---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StoneApplication
source: html/b64a3d8b-6fd9-8d0b-b16d-64b725098a4a.htm
---
# Autodesk.Revit.DB.Visual.Stone.StoneApplication Property

The property labeled "Finish" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StoneApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneApplicationType".